arduino/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Arduino MKR Vidor 4000
# --------------------
mkrvidor.name=Arduino MKR Vidor 4000
mkrvidor.vid.0=0x2341
mkrvidor.pid.0=0x8056
mkrvidor.vid.1=0x2341
mkrvidor.pid.1=0x0056

mkrvidor.upload.tool=bossacI
mkrvidor.upload.protocol=sam-ba
mkrvidor.upload.maximum_size=262144
mkrvidor.upload.use_1200bps_touch=true
mkrvidor.upload.wait_for_upload_port=true
mkrvidor.upload.native_usb=true
mkrvidor.build.mcu=cortex-m0plus
mkrvidor.build.f_cpu=48000000L
mkrvidor.build.usb_product="Arduino MKR Vidor 4000"
mkrvidor.build.usb_manufacturer="Arduino LLC"
mkrvidor.build.board=SAMD_MKRVIDOR
mkrvidor.build.core=arduino
mkrvidor.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags} -DUSE_BQ24195L_PMIC
mkrvidor.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkrvidor.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrvidor.build.variant=mkrvidor
mkrvidor.build.vid=0x2341
mkrvidor.build.pid=0x8056
mkrvidor.bootloader.tool=openocd
mkrvidor.bootloader.file=mkrvidor4000/samd21_sam_ba_arduino_mkrvidor.bin